---
kind: type
id: T:Autodesk.Revit.Exceptions.TransmittedModelException
source: html/5fb430a2-bbcc-34d2-6524-f38972b585ac.htm
---
# Autodesk.Revit.Exceptions.TransmittedModelException

The exception thrown when model was transmitted (sent by eTransmit)
and insufficient OpenOptions were provided to handle its transmitted flag.

## Syntax (C#)
```csharp
[SerializableAttribute]
public class TransmittedModelException : InvalidOperationException
```